{
  "menu-about-me": "About Me",
  "menu-experience": "Experience",
  "menu-projects": "Projects",
  "menu-contact": "Contact",

  "theme-1": "Quiet Oasis",
  "theme-2": "Gentle Neutrality",
  "theme-3": "Urban Landscape",

  "hero-1": "Hello, my name is",
  "hero-2": "A creative full stack web developer.",
  "hero-3": "I am a passionate and creative software engineer specialized in building (and occasionally designing) full stack web applications. Currently, I am focused on developing applications at Infigo IS.",
  "hero-4": "Resume",

  "aboutme-heading": "About Me",
  "aboutme-text-1": "Hello, my name is Antonio, I come from a smaller town called Đurđenovac, and I love creating interesting and challenging applications.",
  "aboutme-text-2": "In 2018, I began my Computer Science journey with a specialization in Software Engineering at the <a target='_blank' href='https://vuv.hr'>University in Virovitica</a>.",
  "aboutme-text-3": "During my time at the University, I acquired knowledge in programming desktop, web, mobile, and CMS applications of varying complexity. I worked with various programming technologies, languages, and frameworks:",
  "aboutme-text-4": "I completed my student internship during my second year of study by attending the Frontend Academy organized by <a target='_blank' href='https://factory.dev'>Factory</a>.",
  "aboutme-text-5": "At the beginning of my third year, I joined <a target='_blank' href='https://www.fina.hr'>Fina</a> as a programmer, also in Virovitica, where I continued to work for the next two years after completing my studies.",
  "aboutme-text-6": "I have many interests, so I spend my free time in various ways. I read books, play basketball, watch movies and series, and engage in social games.",

  "jobs-heading": "Work Experience",
  "jobs-infigo-1": "October 2023 - Present",
  "jobs-infigo-2": "Familiarizing myself with Python and Splunk, along with their syntax.",

  "jobs-fina-1": "October 2021 - October 2023",
  "jobs-fina-2": "I have acquired knowledge on how to carry out a project from start to finish. This includes planning, sketching, and designing the architecture of the application and database, development, potential revisions, to the successful completion of the project.",
  "jobs-fina-3": "Upon employment, I completed a SCRUM course at Algebra in 2022 and participated in the transition to agile work methods. Gained experience in working with agile tools (Jira) and communication tools with designers (Figma).",
  "jobs-fina-4": "Manually tested websites on various browsers and mobile devices to ensure compatibility and responsiveness.",
  "jobs-fina-5": "I wrote modern, efficient, and sustainable code in the .NET development environment using Blazor, Razor Pages, JavaScript, and SQL.",

  "more": "More...",
  "projects-heading": "My Projects",
  "projects-1-name": "Svaštaonica Za Bebe",
  "projects-1-description": "Small passion project where I expanded my Vue.js knowledge and showcased creativity. Created for a client as a product showcase site.",
  "projects-2-name": "Fast Food Pink Panther Crikvenica",
  "projects-2-description": "Medium-sized Vue.js project initiated for client website redesign, showcasing creativity.",
  "projects-3-name": "Smart Villages",
  "projects-3-description": "A larger project done entirely independently for my final thesis.",
  "projects-4-name": "Seriium",
  "projects-4-description": "A mobile application created at college as a project for construction exercises in the subject of Mobile Application Programming.",

  "more-projects-heading": "Other noteworthy projects",
  "more-projects-subheading": "View archive",
  "more-projects-1": "A website created for the University as the official website of the Gastrotop project. <br /><br />The site was built using Wordpress technology and incorporated various plugins.",
  "more-projects-2": "Mobile application created during college as a project for construction exercises in the Mobile Application Programming course. <br /><br />The application is used for tracking movie records.",
  "more-projects-3": "Project developed at college as a project for construction exercises in the CMS Systems course. <br /><br />The project's theme was to create a WordPress theme for a fast food restaurant.",
  "more-projects-4": "Project developed at college as a project for construction exercises in the CMS Systems course. <br /><br />The project's theme was to create a WordPress theme for a gym.",
  "more-projects-5": "First project assigned after employment to gain knowledge in working with Angular and creating APIs. <br /><br />The project's theme was to recreate the ''Movies'' application solely in Angular with its corresponding API.",
  "more-projects-6": "Project developed at college as a project for construction exercises in the WPSP and SPJ courses.<br /><br />The project's theme was to create a program that serves as an informative portal similar to Wikipedia with user authorization.",
  "more-projects-7": "Project developed at college as a project for construction exercises in the WPSP and SPJ courses.<br /><br />The project's theme was to create a task tracking program with user authorization and the use of class hierarchies.",
  "more-projects-8": "Application created at college as a project for construction exercises in the Programming in .NET Environment course.<br /><br />The application is used for keeping track of movies so that users can monitor their favorite watched films.",
  "more-projects-9": "Website created at college as a project for construction exercises in the Fundamentals of Web Programming course.<br /><br />The project's theme was chosen to address potential issues related to hotel chain management.",
  "show-more": "Show More",

  "contact-heading": "Contact",
  "contact-subheading": "Let's stay connected",
  "contact-text": "Open to new opportunities and challenges, my inbox is always open. Whether you have a question or just want to say hello, I'll make sure to respond!",
  "contact-getintouch": "Get in touch",

  "footer": "Designed and built by Antonio Sertić",

  "archive-heading": "My Projects",
  "archive-subheading": "List of all the projects I've worked on",
  "archive-table-year": "Year",
  "archive-table-name": "Name",
  "archive-table-place": "Location",
  "archive-table-tech": "Technologies",
  "university": "University",

  "resume-modal-1": "Configuration for opening the resume",
  "resume-modal-2": "Select language:",
  "resume-modal-3": "Select theme:",
  "resume-modal-4": "Close",
  "resume-modal-5": "Open",

  "single-project-svastaonica-za-bebe": "<p>The 'Svaštaonica Za Bebe' website is a small passion project through which I wanted to enhance my knowledge of Vue.js and showcase my creativity. It was also created for a client to beautifully display all of their products in one place.</p><p>The website is built as a <b>Single Page Application</b>, utilizing the following technologies: <b>HTML</b>, <b>CSS</b> with <b>Bootstrap 5.0.2</b>, and the latest <b>Vue.js 3</b> with the <b>Composition API</b>. The site is responsive, adapting to both desktop and mobile devices.</p><p>The design of the website follows modern web design principles, including font scaling, spacing between elements and text, and various other aspects. It incorporates numerous interactive <i>hover</i> effects that are not overly intrusive. Its appearance resembles that of an online store with added creativity and something new.</p><p>The website is hosted on Netlify and can be visited <a href='https://svastaonicazabebe.netlify.app' class='link' target='_blank'>through the following link</a>.</p>",

  "single-project-pink-panther": "<p>The Fast Food Pink Panther Crikvenica website is a medium-sized, passion project through which I wanted to start learning Vue.js and showcase my creativity. It was also created based on the client's need for redesigning an existing website.</p><p>The website is built as a <b>Single Page Application</b>, using the following technologies: <b>HTML</b>, <b>CSS</b> with <b>Bootstrap 5.0.2</b>, and the latest <b>Vue.js 3</b> with the <b>Composition API</b>. It also utilizes <b>Leaflat</b>, a JavaScript library for interactive maps, and it's worth mentioning that <b>Vue I18n</b>, an internationalization plugin for Vue.js, is implemented. The site was originally designed for mobile devices but was later adapted for desktop and tablet use as well.</p><p>The design of the website adheres to modern web design principles, including font scaling, spacing between elements and text, and various other aspects. Its appearance resembles that of a restaurant's website more than a fast-food site, which was intentional to align with their specific culture.</p><p>A personalized style guide was also created for the website to facilitate the learning of style guide development. The style guide can be downloaded by clicking on the following button.</p>",
  "before-and-after-redesign": "Before & After redesign",

  "single-project-smart-villages": "<p>The Smart Villages web application is a larger project that I completed entirely independently at college. The project was submitted as my final thesis and was treated as such from the beginning. It involved designing the application, developing all its functionalities, and designing the database.</p><p>The purpose of the application is to allow sellers to add their local products to a 'Marketplace' where customers can then place orders. After a product is marked as delivered, the customer can rate and comment on it. The application also integrates real-time messaging between customers and sellers.</p><p>The application is built as a <b>Single Page Application</b> using the following technologies: <b>Blazor - WebAssembly</b> in ASP.NET Core, <b>Entity Framework Core</b> for database creation and migrations, <b>SignalR</b> for real-time notifications (messages), <b>MudBlazor</b> - Blazor Component Library for design, and <b>Microsoft SQL Server</b> for database management.</p><p><!-- Write about the app and API architecture here if needed. --></p><p>The application includes a straightforward <i>sign-up/registration</i> process that requires email verification. It also features <i>real-time messaging</i> with read/unread options.</p>",

  "single-project-seriium": "<p>The Seriium mobile application was created at college as a project for construction exercises in the <b>Mobile Application Programming</b> course.</p><p>The application is designed for tracking TV series, allowing users to keep track of where they left off.</p><p>The app includes <i>sign-in and registration</i> using <b>Firebase</b>, with email verification.</p><p><b>When signed in, users can:</b></p><ol class='ordered-list'><li>View their list of series</li><li>Search for series</li><li>View details of individual series</li><li>Add and remove series from their list</li><li>Mark and unmark watched seasons and episodes</li></ol><p>Additionally, there is detailed <i>statistics</i> showing the total time spent watching series, the total number of series, seasons, and episodes watched, as well as the top two genres.</p><p>Users have access to their profile where they can update all their information.</p><p>The project was developed in Android Studio, using <b>Java</b> as the programming language, along with a <b>Firebase</b> database. Knowledge of various Android development aspects was applied, including activities, adapters, fragments, listeners, model creation, and network communication.</p><p>For listing series, seasons, and episodes, a <b>RecyclerView</b> was used, and for fetching series data, <b>Retrofit</b> was employed, connecting to the <a class='link' href='https://www.episodate.com/api' target='_blank'>EPISODATE API</a> for data retrieval.</p>",
  "sketches-and-final-version": "Sketches & Final version",

  "single-project-achilles-gym": "<p>The Achilles Gym project was created at college as an exercise in the <b>CMS Systems</b> course.</p><p>The project's goal was to create a WordPress theme for a gym using custom post types, taxonomies, and custom meta boxes.</p><p>The website demonstrates all the knowledge acquired using <b>WordPress</b> technology, which utilizes the <b>PHP</b> programming language and <b>MySQL</b> for the database.</p><p><b>Administrative Interface</b></p><ul class='unordered-list'><li>The <b>Program</b> custom post type contains the <b>Equipment</b> custom post type, connected through a custom meta box</li><li>The <b>Trainer</b> custom post type contains the <b>Program</b> custom post type, also connected through a custom meta box</li><li>There is also a <b>Fun Fact</b> custom post type</li><li>Each custom post type has its unique taxonomy</li></ul><p><b>On the website, you can:</b></p><ul class='unordered-list'><li>View fun facts</li><li>View programs, their trainers, and equipment</li><li>View trainers and their programs</li><li>View equipment and their programs</li><li>Find gym locations on the map</li></ul>",

  "single-project-cinema-mon-amour": "<p>The Cinema Mon Amour mobile application was created at college as an exercise in the <b>Mobile Application Programming</b> course.</p><p>The application is designed for tracking movies so users can keep track of their favorite films.</p><p><b>In the application, you can:</b></p><ol class='ordered-list'><li>View a list of movies</li><li>Access movie details (release date, IMDb rating, and description)</li><li>Add movies to favorites with personalized ratings</li><li>View favorite movies</li><li>Remove movies from favorites</li></ol><p>The project was developed in Android Studio, using <b>Java</b> as the programming language. Knowledge of various Android development aspects was applied, including activities, adapters, fragments, listeners, model creation, and network communication.</p><p>The local <b>Room</b> database was chosen for storing data, and <b>Retrofit</b> was used to retrieve movie data from <a class='link' href='https://www.themoviedb.org/documentation/api' target='_blank'>TMDb API</a>.</p>",

  "single-project-digipedia": "<p>The Digipedia project was created at college as an exercise in the <b>Server-Side Web Programming</b> and <b>Scripting Languages</b> courses.</p><p>The project aimed to create an informational portal similar to Wikipedia with user authorization. It includes categories, articles, and sub-articles accessible to everyone, along with an admin interface for managing all site content.</p><p>The website showcases knowledge of the following web technologies: <b>AngularJs v1.6.9</b> with <b>jQuery 3.2.1</b>, <b>PHP 7</b>, and <b>Bootstrap 3.3.7</b> for design. The database used is <b>MySQL</b>.</p><p><b>The site features three types of views:</b></p><ol class='ordered-list'><li>For regular site guests who can access all articles and the site is read-only for them</li><li>For logged-in users who can add articles and sub-articles, as well as rate all articles. They have control over their articles and sub-articles, being able to edit and delete them</li><li>For logged-in admins who can manage all users, categories, and articles, meaning they can add, edit, and delete them. They also have access to the article edit history to see who edited each article and when</li></ol>",
  "single-project-ghost-loggedin-admin": "Unauthenticated user, Logged-in regular user & Logged-in admin",

  "single-project-filmovi": "<p>The Filmovi application was created at college as an exercise in the <b>Programming in the .NET Environment</b> course.</p><p>The application is designed for tracking movies so users can keep track of their favorite films.</p><p>The project was developed in Visual Studio using <b>Windows Forms (.NET)</b> framework with <b>C#</b>, and it uses <b>Microsoft SQL Server</b> for database management.</p><p>The application includes user login and registration with necessary parameter checks. For previously saved movies, there is a feature to refresh IMDb ratings when the user clicks the Refresh button.</p><p>For retrieving movie data, the application uses the <a class='link' target='_blank' href='https://www.omdbapi.com/'>OMDb API</a>.</p><p><b>After successful login, the application allows users to:</b></p><ol class='ordered-list'><li>Search for movies by title and year</li><li>View details of individual movies</li><li>Add movies to their watchlist with personal ratings</li><li>View their watchlist</li><li>Search for movies in their watchlist by title, year, and genre</li><li>Update assigned ratings</li><li>Remove movies from their watchlist</li></ol>",

  "single-project-gastrotop": "<p>The Gastrotop website was created during college as part of a larger project during my student days.</p><p>The project aimed to improve education accessibility in the field of <b>Consumer Market Special Dietary Needs</b> through various training programs, student workshops, panel discussions, and educational events.</p><p>The website was built using <b>WordPress</b> technology with the use of various plugins, including:</p><ul class='unordered-list'><li>Duplicator</li><li>Envira Gallery</li><li>Smooth Back To Top Button</li><li>Tabs Responsive</li><li>wpDataTables - Tables & Table Charts</li><li>Elementor</li></ul><p>The website is filled with posts from various events in Hungary and Croatia, so it has translations in Croatian, Hungarian, and English languages, for which the <b>Polylang</b> plugin was used.</p><p>The website is hosted on Netlify and can be visited <a href='http://gastrotop.hr/' class='link' target='_blank'>here</a>.</p>",

  "single-project-hoteli": "<p>The Hoteli website was created at college as an exercise in the <b>Basics of Web Programming</b> course.</p><p>The project topic was chosen to address potential issues related to managing a hotel chain.</p><p>The website demonstrates knowledge of basic web technologies such as <b>HTML</b>, <b>CSS</b> with <b>Bootstrap 3.3.7</b>, and <b>JavaScript</b> with <b>jQuery</b>. It uses <b>Firebase</b> for the database.</p><p>User login and registration are enabled through Firebase with complete parameter verification, including email format checks.</p><p><b>The website features 3 types of views:</b></p><ol class='ordered-list'><li>For regular site guests who can only view the list of hotels</li><li>For logged-in users who can reserve hotel rooms</li><li>For logged-in admins who can manage the hotels themselves by editing, deleting, adding new ones, and removing reservations. They also have access to statistics and can add new admins.</li></ol>",

  "single-project-moviium": "<p>The creation of the Moviium website was assigned to me as my first project after employment to gain knowledge in working with Angular and creating APIs.</p><p>The project's topic was to create a copy of a previous personal college application called 'Filmovi' but in Angular and with an associated API for data processing and database communication.</p><p>The website was developed using <b>Angular</b> with <b>Bootstrap</b> for design. For the API, <b>ASP.NET Core Web API</b> was used, which utilizes <b>Swagger</b> for displaying created controllers. <b>Microsoft SQL Server</b> was used for the database.</p><p>The application includes login and registration with necessary parameter checks. To retrieve movie data and its details, it uses the <a class='link' target='_blank' href='https://www.omdbapi.com/'>OMDb API</a>.</p><p><b>After successful login, the application allows users to:</b></p><ol class='ordered-list'><li>Search for movies by title</li><li>View details of individual movies</li><li>Add movies to their watchlist with personal ratings</li><li>View their watchlist</li><li>Update assigned ratings</li><li>Remove movies from their watchlist</li></ol>",

  "single-project-tasty-trap": "<p>The Tasty Trap project was created at college as an exercise in the <b>CMS Systems</b> course.</p><p>The project's goal was to create a WordPress theme for a fast-food restaurant using custom post types, taxonomies, and custom meta boxes.</p><p>The website demonstrates all the knowledge acquired using <b>WordPress</b> technology, which utilizes the <b>PHP</b> programming language and <b>MySQL</b> for the database.</p><p><b>Administrative Interface</b></p><ul class='unordered-list'><li>The <b>Menu</b> custom post type contains <b>Food</b> and <b>Drink</b> custom post types, connected through custom meta boxes</li><li>The <b>Food</b> and <b>Drink</b> custom post types have their custom meta boxes for nutritional values, which are summed up in the menu display</li><li>There are also <b>Employee</b>, <b>Restaurant</b>, and <b>News</b> custom post types with their custom meta boxes</li><li>Each custom post type also has its unique taxonomy</li><li>The <b>MetaSlider</b> plugin is used to display employees in a slider format</li></ul><p><b>On the website, you can:</b></p><ul class='unordered-list'><li>View menus, their food, and drinks</li><li>View food sorted by taxonomy</li><li>View drinks sorted by taxonomy</li><li>View news</li><li>View featured employees and their stories</li><li>Find locations on the map</li><li>Search the website</li></ul>",

  "single-project-zadaci": "<p>The Zadaci project was created at college as an exercise in the <b>Server-Side Web Programming</b> and <b>Scripting Languages</b> courses.</p><p>The project's topic was to create a task management program with user authentication and using hierarchies where the Comment class contains objects of the User and Task classes.</p><p>The website demonstrates all the knowledge acquired in the following web technologies: <b>AngularJs v1.6.9</b> with <b>jQuery 3.2.1</b>, <b>PHP 7</b>, and it uses <b>Bootstrap 4.4.1</b> for design. The database used is <b>MySQL</b>.</p><p><b>When logged in, users can:</b></p><ul class='unordered-list'><li>View their profile and update their information</li><li>Visit profiles of other people they collaborate with on tasks</li><li>Browse their completed and uncompleted tasks, which they can also sort and search by name</li><li>Users can comment on their tasks (tasks they are assigned to) and mark them as completed. They can also edit and delete their comments on these tasks</li><li>Browse created tasks, which they can also sort and search by name, and create new tasks</li><li>Edit, comment on, and delete created tasks and edit and delete their comments on these tasks</li><li>If a user, who created a resolved task, doesn't consider it truly completed, they can return it to the active state</li></ul>"
}
