{
  "menu-about-me": "About Me",
  "menu-experience": "Experience",
  "menu-projects": "Projects",
  "menu-contact": "Contact",

  "hero-1": "Hello, my name is",
  "hero-2": "A creative full stack web developer.",
  "hero-3": "I am a passionate and creative software engineer specialized in building (and occasionally designing) full stack web applications. Currently, I am focused on developing applications at Fina.",
  "hero-4": "Resume",

  "aboutme-heading": "About Me",
  "aboutme-text-1": "Hello, my name is Antonio, I come from a smaller town called Đurđenovac, and I love creating interesting and challenging applications.",
  "aboutme-text-2": "In 2018, I began my Computer Science journey with a specialization in Software Engineering at the Polytechnic in Virovitica.",
  "aboutme-text-3": "During my time at the Polytechnic, I acquired knowledge in programming desktop, web, mobile, and CMS applications of varying complexity. I worked with various programming technologies, languages, and frameworks:",
  "aboutme-text-4": "I completed my student internship during my second year of study by attending the Frontend Academy organized by Factory.",
  "aboutme-text-5": "At the beginning of my third year, I joined Fina as a programmer, also in Virovitica, where I continued to work for the next two years after completing my studies.",
  "aboutme-text-6": "I have many interests, so I spend my free time in various ways. I read books, play basketball, watch movies and series, and engage in social games.",

  "jobs-heading": "Work Experience",
  "jobs-infigo-1": "October 2023 - Present",
  "jobs-infigo-2": "Familiarizing myself with Python and Splunk, along with their syntax.",

  "jobs-fina-1": "October 2020 - October 2023",
  "jobs-fina-2": "I have acquired knowledge on how to carry out a project from start to finish. This includes planning, sketching, and designing the architecture of the application and database, development, potential revisions, to the successful completion of the project.",
  "jobs-fina-3": "Upon employment, I completed a SCRUM course at Algebra in 2022 and participated in the transition to agile work methods. Gained experience in working with agile tools (Jira) and communication tools with designers (Figma).",
  "jobs-fina-4": "Manually tested websites on various browsers and mobile devices to ensure compatibility and responsiveness.",
  "jobs-fina-5": "I wrote modern, efficient, and sustainable code in the .NET development environment using Blazor, Razor Pages, JavaScript, and SQL."
}
