{
  "menu-about-me": "O Meni",
  "menu-experience": "Iskustvo",
  "menu-projects": "Projekti",
  "menu-contact": "Kontakt",

  "theme-1": "Mirna Oaza",
  "theme-2": "Blaga Neutralnost",
  "theme-3": "Urbani Krajolik",

  "hero-1": "Pozdrav, zovem se",
  "hero-2": "Kreativni full stack web developer.",
  "hero-3": "Strastveni sam i kreativni softverski inženjer specijaliziran za izgradnju (i povremeno dizajniranje) full stack web aplikacija. Trenutačno sam usredotočen na razvoj aplikacija u <a target='_blank' href='https://www.infigo.hr'>Infigo IS</a>.",
  "hero-4": "Životopis",

  "aboutme-heading": "O meni",
  "aboutme-text-1": "Pozdrav, zovem se Antonio, dolazim iz Našica i volim kreirati zanimljive i izazovne aplikacije.",
  "aboutme-text-2": "Godine 2018. sam započeo s pohađanjem Računarstva smjer Programsko inženjerstvo na <a target='_blank' href='https://vuv.hr'>Veleučilištu u Virovitici</a>.",

  "aboutme-text-3": "Na Veleučilištu sam usvojio znanja programiranja desktop, web, mobilnih i cms aplikacija koje su varirale po svojoj zahtjevnosti. Koristio sam se raznim programskim tehnologijama, jezicima i okvirima:",
  "aboutme-text-4": "Studentsku praksu sam odradio na drugoj godini studija, pohađanjem frontend akademije koju je održavao <a target='_blank' href='https://factory.dev'>Factory</a>.",
  "aboutme-text-5": "Početkom treće godine sam se zaposlio kao programer u <a target='_blank' href='https://www.fina.hr'>Fini</a>, također u Virovitici gdje sam nakon studiranja nastavio raditi naredne dvije godine.",
  "aboutme-text-6": "Krajem 2023. godine, donio sam odluku da proširim svoje vidike, znanja i iskustva te sam se pridružio <a target='_blank' href='https://www.infigo.hr'>Infigo-u</a> u Zagrebu kao softverski developer.",
  "aboutme-text-7": "Van radnog vremena, istražujem različite interese i strasti. Učim nove tehnologije i neprestano nadograđujem znanje iz programskih jezika koje već poznajem. Uz to, uživam u čitanju knjiga, gledanju filmova i serija, ali najviše uživam u igranju društvenih igara.",

  "jobs-heading": "Radno iskustvo",
  "jobs-infigo-1": "Listopad 2023 - Danas",
  "jobs-infigo-2": "Radio u dinamičnom okruženju na nekoliko većih aplikacija istovremeno (do 3 po sprintevima), raspisivao i pratio tikete te koordinirao zadatke unutar tima.",
  "jobs-infigo-3": "Razvijao nove funkcionalnosti i custom komponente koristeći moderno JavaScript iskustvo.",
  "jobs-infigo-4": "Učio i koristio Python, Linux (Ubuntu) i Docker kroz svakodnevni rad i razvoj internog softvera.",
  "jobs-infigo-5": "Pisao testove koristeći pytest i sudjelovao u code reviewu, gdje sam primao i davao konstruktivne kritike, osiguravajući kvalitetu i održivost koda te dodatno unapređujući svoje vještine.",
  "jobs-infigo-6": "Radio sa <a target='_blank' href='https://www.splunk.com'>Splunk-om</a> na internim aplikacijama te položio Splunk certifikat za Admina.",
  "jobs-infigo-7": "Stekao praktična znanja iz Data Analize kroz suradnju s Data Analyst timom i korištenjem Splunka.",
  "jobs-infigo-8": "Pisao dokumentaciju za projekte i nove funkcionalnosti dok sam ih razvijao.",
  "jobs-infigo-9": "Stekao osnovna znanja iz AML-a, SIEM-a, Compliance-a i drugih cyber security područja kroz praktičan rad na projektima.",

  "jobs-fina-1": "Listopad 2021 - Listopad 2023",
  "jobs-fina-2": "Usvojio znanja potrebna za vođenje projekta od početka do kraja – od planiranja, skiciranja i osmišljavanja arhitekture aplikacije i baze podataka, preko same izrade i prilagodbi, do uspješno dovršenog projekta. Iako projekt nije bio velik, bio je dovoljno izazovan da obuhvati sve ključne faze razvoja.",
  "jobs-fina-3": "Položio sam SCRUM tečaj u Algebri 2022 i sudjelovao u prijelazu na agilne metode rada. Stekao iskustva u radu s agilnim alatima (Jira) i alatima za komunikaciju s dizajnerima (Figma).",
  "jobs-fina-4": "Ručno testirao web stranice u različitim preglednicima i mobilnim uređajima kako bi se osigurala kompatibilnost i responzivnost.",
  "jobs-fina-5": "Pisao moderan, učinkovit i održiv kod u .NET razvojnoj okolini koristeći Blazor, Razor Pages, JavaScript i SQL.",

  "more": "Više..",
  "projects-heading": "Moji projekti",
  "projects-1-name": "Svaštaonica Za Bebe",
  "projects-1-description": "Mali strastveni projekt preko kojega sam proširio znanje Vue.js-a i pokazao svoju kreativnost. Kreirana je za potrebe klijenta kao mala ogledna stranica za prikaza svih proizvoda iz ponude.",
  "projects-2-name": "Fast Food Pink Panther Crikvenica",
  "projects-2-description": "Srednje-velik, strastveni projekt preko kojega sam započeo izučavanje Vue.js-a i pokazao svoju kreativnost. Kreirana je iz potrebe klijenta za redizajnom postojeće stranice.",
  "projects-3-name": "Smart Villages",
  "projects-3-description": "Veći projekt koji je rađen potpunosti samostalno za završni rad.",
  "projects-4-name": "Seriium",
  "projects-4-description": "Mobilna aplikacija nastala na faksu kao projekt za konstrukcijske vježbe za predmet Programiranje mobilnih aplikacija.",

  "more-projects-heading": "Ostali projekti vrijedni pažnje",
  "more-projects-subheading": "pogledaj arhivu",
  "more-projects-1": "Web stranica rađena za veleučilište kao službena web stranica projekta Gastrotop. <br /><br />Stranica je rađena u Wordpress tehnologiji uz korištenje raznih plugin-ova.",
  "more-projects-2": "Mobilna aplikacija nastala na faksu kao projekt za konstrukcijske vježbe za predmet Programiranje mobilnih aplikacija. <br /><br />Aplikacija služi za vođenje evidencije filmova.",
  "more-projects-3": "Projekt nastao na faksu kao projekt za konstrukcijske vježbe iz predmeta CMS sustavi. <br /><br />Tema projekta je bila kreirati wordpress temu za fast food.",
  "more-projects-4": "Projekt nastao na faksu kao projekt za konstrukcijske vježbe iz predmeta CMS sustavi. <br /><br />Tema projekta je bila kreirati wordpress temu za teretanu.",
  "more-projects-5": "Prvi projekt dodijeljen nakon zaposlenja kako bi stekao znanja u radu sa Anularom i kreiranju API-ja. <br /><br />Tema projekta je bila rekreirati aplikaciju ''Filmovi'' samo u Angularu i s pripadajućim api-jem.",
  "more-projects-6": "Projekt nastao na faksu kao projekt za konstrukcijske vježbe iz predmeta WPSP i SPJ.<br /><br />Tema projekta je bila kreirati program koji će služiti kao informativni portal nalik Wikipedi-i s autorizacijom korisnika.",
  "more-projects-7": "Projekt nastao na faksu kao projekt za konstrukcijske vježbe iz predmeta WPSP i SPJ.<br /><br />Tema projekta je bila kreirati program za evidenciju zadataka s autorizacijom korisnika i korištenjem hijerarhija klasa.",
  "more-projects-8": "Aplikacija nastala na faksu kao projekt za konstrukcijske vježbe za predmet Programiranje u .NET okolini.<br /><br />Aplikacija služi za vođenje evidencije filmova kako bi si korisnik mogao pratiti omiljene pogledane filmove.",
  "more-projects-9": "Stranica nastala na faksu kao projekt za konstrukcijske vježbe za predmet Osnove Web Programiranja.<br /><br />Tema projekta je izabrana zbog rješavanja potencijalne problematike vođenja lanca hotela.",
  "more-projects-10": "Glavni cilj ovog projekta je stvoriti Python skriptu koja provodi sveobuhvatnu analizu registracijskih pločica. Skripta izračunava različite statistike i pojedinosti igre, sprema rezultate u strukturiranu CSV datoteku.",
  "more-projects-11": "Web aplikacija dizajnirana za upravljanje kinima, omogućavajući korisnicima rezervaciju sjedala za različite filmove.",
  "show-more": "Prikaži više",

  "contact-heading": "Kontakt",
  "contact-subheading": "Budimo u kontaktu",
  "contact-text": "Otvoren za nove prilike i izazove, moj inbox je uvijek otvoren. Bilo da imate pitanje ili samo želite pozdraviti, potrudit ću se da vam odgovorim!",
  "contact-getintouch": "Javi se",

  "footer": "Dizajnirao i izgradio Antonio Sertić",

  "archive-heading": "Moji projekti",
  "archive-subheading": "Popis svih projekata na kojima sam radio",
  "archive-table-year": "Godina",
  "archive-table-name": "Naziv",
  "archive-table-place": "Mjesto",
  "archive-table-tech": "Tehnologije",
  "university": "Sveučilište",

  "resume-modal-1": "Konfiguracija za otvaranje životopisa",
  "resume-modal-2": "Odaberite jezik:",
  "resume-modal-3": "Odaberite temu:",
  "resume-modal-4": "Zatvori",
  "resume-modal-5": "Otvori",

  "single-project-svastaonica-za-bebe": "<p>Stranica Svaštaonica Za Bebe je mali strastveni projekt preko kojega sam želio usavršiti znanje Vue.js-a te pokazati svoju kreativnost. Isto tako kreirana je za potrebe klijenta u svrhu lijepog prikaza svih njegovih proizvoda na jednome mjestu.</p><p>Stranica je rađena kao <b>Single Page Application</b> te su se za izradu stranice koristile sljedeće tehnologije: <b>HTML</b>, <b>CSS</b> uz <b>Bootstrap 5.0.2.</b>, te je od JavaScript frameworka izabran najnoviji <b>Vue.js 3</b> uz <b>Composition API</b>. Stranica je osim desktop uređaja prilagođena i mobilnim uređajima.</p><p> Dizajn stranice je popraćen modernim web dizajn pravilima kao što su skaliranje fonta, razmaci između elemenata i tekstova i razne druge stvari. Sadrži dosta interaktivnih <i>hover</i> efekata koji ujedno i nisu previše ''napadni''. Izgledom podsjeća na web trgovinu s dodatkom vlastite kreativnosti i <i>nečeg novog</i>.</p><p> Stranica je hostana na Netlify-u te ju se može posjetiti <a href='https://svastaonicazabebe.netlify.app' class='link' target='_blank'>preko sljedećeg linka</a>.</p>",

  "single-project-pink-panther": "<p>Stranica Fast Food Pink Panther Crikvenica je srednje-velik, strastveni projekt preko kojega sam želio započet izučavanje Vue.js-a te pokazati svoju kreativnost. Isto tako kreirana je iz potrebe klijenta za redizajnom postojeće stranice.</p><p>Stranica je rađena kao <b>Single Page Application</b> te su se za izradu stranice koristile sljedeće tehnologije: <b>HTML</b>, <b>CSS</b> uz <b>Bootstrap 5.0.2.</b>, te je od JavaScript frameworka izabran najnoviji <b>Vue.js 3</b> uz <b>Composition API</b>. Korištena je i <b>Leaflat</b> - JavaScript biblioteka za interaktivne karte, a mora se spomenuti i da je implementiran <b>Vue I18n</b> - Internacionalizacijski plugin za Vue.js. Stranica je prvotno bila prilagođena samo mobilnim uređajima, ali je potom prilagođena i desktop uređajima te tabletima. <br /></p><p>Dizajn stranice je popraćen modernim web dizajn pravilima kao što su skaliranje fonta, razmaci između elemenata i tekstova i razne druge stvari. Izgledom više podsjeća na stranicu restorana prije nego fast fooda, ali to je ciljano jer je njihova kultura to jednostavno zahtijevala.</p><p>Za stranicu je također izrađen i personalizirani style guide iz želje za učenjem izrade istih. Style guide se može preuzeti klikom na sljedeći gumb.</p>",
  "before-and-after-redesign": "Prije & Nakon redizajna",

  "single-project-smart-villages": "<p>Web aplikacija Smart Villages je veći projekt koji je rađen potpunosti samostalno na fakultetu. Projekt je predan kao završni rad te je kao takav bio i tretiran od samog početka. Od osmišljavanja dizajna i svih funkcionalnosti aplikacije do dizajna baze podataka.</p><p> Svrha aplikacije je da prodavači mogu dodavati svoje domaće proizvode na takozvanu ''Tržnicu'' gdje potom kupci mogu naručivati iste. Nakon što proizvod bude označen kao dostavljen kupac ga može ocijeniti i komentirati. Također integrirao je i real-time slanje poruka između kupaca i prodavača.</p><p> Aplikacija je rađena kao <b>Single Page Application</b> te su se za izradu stranice koristile sljedeće tehnologije: <b>Blazor - WebAssembly</b> u ASP.NET Core-u, <b>Entity Framework Core</b> za kreiranje i migracije baze podataka, <b>SignalR</b> za slanje real-time obavijesti(poruka), <b>MudBlazor</b> - Blazor Component Library za dizajn, <b>Microsoft SQL Server</b> za rad s bazom podataka.</p><p><!-- napisati o arhitekturi app i api-ju --></p><p> Aplikacija sadrži jednostavan proces <i>prijave/registracije</i> za koje je potrebna verifikacija mailom. Integrirano je <i>real-time slanje poruka</i> uz opcije pročitana/nepročitana.</p>",

  "single-project-seriium": "<p>Mobilna aplikacija Seriium je nastala na fakultetu kao projekt za konstrukcijske vježbe za predmet <b>Programiranje mobilnih aplikacija</b>.</p> <p>Aplikacija služi za vođenje evidencije serija kako bi si korisnik mogao pratiti gdje je stao s gledanjem.</p><p>Tu su dakle <i>prijava i registracija</i> koji rade putem <b>Firebase-a</b> za koje postoji opcija potvrde profila mail adresom.</p><p><b>Kada se prijavi u aplikaciju, korisnik može:</b></p><ol class='ordered-list'><li>vidjeti svoju listu serija</li><li>pretražiti serije</li><li>pogledati detalje pojedine serije</li><li>dodavati i micati serije iz svoje liste</li><li>označavati i odznačavati pogledane sezone i epizode</li></ol><p>Uz to se nalazi i detaljna <i>statistika</i> gdje korisnik može vidjeti koliko je sveukupno vremena potrošio gledajući serije, ukupan broj pogledanih serija, sezona i epizoda te najgledanija dva žanra.</p><p>Korisnik ima i uvid u svoj profil na kojemu može mijenjati sve podatke.</p><p>Projekt je rađen u Android Studiju, a za programski jezik izabrana je <b>Java</b> uz <b>Firebase</b> bazu podataka. Primijenjena su znanja korištenja: <i>activity-ja</i>, <i>adaptera</i>, <i>fragmenta</i>, <i>listenera</i>, <i>izrade modela</i> i <i>služenja network-om</i>.</p><p>Za izlistavanje serija, sezona i epizoda korišten je <b>RecyclerView</b>, a za dohvaćanje podataka o serijama koristi se <b>Retrofit</b> koji se spaja na <a class='link' href='https://www.episodate.com/api' target='_blank'>EPISODATE API</a> radi dohvaćanja podataka o serijama.</p>",
  "sketches-and-final-version": "Skice & Završna verzija",

  "single-project-achilles-gym": "<p>Projekt Achilles Gym je nastao na fakultetu kao projekt za konstrukcijske vježbe iz predmeta <b>CMS sustavi</b>.</p><p>Tema projekta je bila kreirati wordpress temu za teretanu koristeći custom post type-ove, taksonomije i custom meta box-ove.</p><p>Stranica prikazuje sva naučena znanja o korištenju <b>Wordpress</b> tehnologijom koja koristi <b>PHP</b> programski jezik i <b>MySQL</b> za bazu podataka.</p><p><b>Administrativno sučelje</b></p><ul class='unordered-list'><li>cpt <b>Program</b> sadrži cpt <b>Sprava</b> povezan preko custom meta box-a</li><li>cpt <b>Trener</b> sadrži cpt <b>Program</b> isto povezan preko custom meta box-a</li><li>tu je još i cpt <b>Zanimljivost</b></li><li>svaki cpt također ima i svoju jedinstvenu taksonomiju</li></ul><p><b>Na stranici je moguće:</b></p><ul class='unordered-list'><li>pregledati zanimljivosti</li><li>pregledati programe, njihove trenere i sprave</li><li>pregledati trenere i njihove programe</li><li>pregledati sprave i njihove programe</li><li>pronaći lokacije teretana na karti</li></ul>",

  "single-project-cinema-mon-amour": "<p>Mobilna aplikacija Cinema Mon Amour je nastala na fakultetu kao projekt za konstrukcijske vježbe za predmet<b>Programiranje mobilnih aplikacija</b>.</p><p>Aplikacija služi za vođenje evidencije filmova kako bi si korisnik mogao pratiti omiljene pogledane filmove.</p><p><b>U aplikaciji je moguće:</b></p><ol class='ordered-list'><li>vidjeti listu filmova</li><li>pregled detalja filmova (datum izlaska, imdb ocjenu i opis)</li><li>dodavanje filmova u favorite uz dodjelu vlastite ocjene pojedinom filmu</li><li>pregled favorita gdje se vide svi dodani filmovi</li><li>uklanjanje filmova iz favorita</li></ol><p>Projekt je rađen u Android Studiju, a za programski jezik izabrana je <b>Java</b>. Primijenjena su znanja korištenja: <i>activity-ja</i>, <i>adaptera</i>, <i>fragmenta</i>, <i>listenera</i>, <i>izrade modela</i> i <i>služenja network-om</i>.</p><p>Kao baza podataka izabrana je lokalna baza podataka <b>Room</b>, a za dohvaćanje filmova i njihovih podataka koristi se <b>Retrofit</b> koji se spaja na <a class='link' href='https://www.themoviedb.org/documentation/api' target='_blank'>TMDb API</a>.</p>",

  "single-project-digipedia": "<p>Projekt Digipedia je nastao na fakultetu kao projekt za konstrukcijske vježbe iz predmeta <b>Web programiranje na strani poslužitelja</b> i <b>Skriptni programski jezici</b>.</p><p>Tema projekta je bila kreirati program koji će služiti kao informativni portal nalik Wikipedi-i s autorizacijom korisnika. Program treba sadržavati kategorije, članke i podčlanke koji su dostupni svima te administrativno sučelje za admina pomoću kojeg će moći upravljati svime na stranici.</p><p>Stranica prikazuje sva naučena znanja o sljedećim web tehnologijama:<b>AngularJs v1.6.9</b> uz <b>jQuery 3.2.1</b>, <b>PHP 7</b> i korišten je <b>Bootstrap 3.3.7</b> za dizajn. A za bazu se koristio <b>MySQL</b>.</p><p><b>Stranica sadrži 3 vrste pregleda:</b></p><ol class='ordered-list'><li>Za običnog gosta stranice koji može pristupiti svim člancima na stranici te mu je sve <i>read-only</i>.</li><li>Za prijavljenog korisnika koji može dodavati članke i podčlanke, te dati ocjenu svim člancima. Isto tako ima svu kontrolu nad svojim člancima i podčlancima jer ih može uređivati i brisati.</li><li>Za prijavljenog admina koji može upravljati svim korisnicima, kategorijama i člancima, znači dodavati, uređivati i brisati ih. Također ima i uvid u povijest uređivanja članaka gdje može vidjeti tko je kada i koji članak uređivao.</li></ol>",
  "single-project-ghost-loggedin-admin": "Neprijavljeni korisnik, Prijavljeni obični korisnik & Prijavljeni admin",

  "single-project-filmovi": "<p>Aplikacija Filmovi je nastala na fakultetu kao projekt za konstrukcijske vježbe za predmet <b>Programiranje u .NET okolini</b></p><p>Aplikacija služi za vođenje evidencije filmova kako bi si korisnik mogao pratiti omiljene pogledane filmove.</p><p>Projekt je rađen u Visual Studiju unutar <b>Windows Forms(.NET)</b> programskog okvira koji koristi <b>C#</b>, a za rad s bazom podataka koristi se <b>Microsoft SQL Server</b>.</p><p>Aplikacija sadrži prijavu i registraciju uz potrebne provjere unesenih parametara. Za već spremljene filmove ima provjera i ažuriranje imdb ocjena kada korisnik klikne na button Refresh.</p><p>Za dohvaćanje filmova i njihovih podataka koristi se <a class='link' target='_blank' href='https://www.omdbapi.com/'>OMDb API</a>.</p><p><b>Nakon uspješne prijave, u aplikaciji je moguće:</b></p><ol class='ordered-list'><li>pretražiti filmove po nazivu i godini</li><li>pogledati detalje pojedinog filma</li><li>dodavanje filmova u svoju listu uz dodjelu vlastite ocjene</li><li>pogledati svoju listu filmova</li><li>pretražiti filmove u svojoj listi po nazivu, godini i žanru</li><li>ažurirati dodijeljene ocjene</li><li>uklanjanje filmova iz svoje liste</li></ol>",

  "single-project-gastrotop": "<p>Stranica Gastrotop je rađena za vrijeme studentskih dana za fakultet kao dio velikog projekta.</p><p>Cilj projekta je poboljšati dostupnost edukacije u području POTROŠAČKOG TRŽIŠTA POSEBNIH OGRANIČIVANJA PREHRANE kroz razne programe obuke, studentske radionice, panel diskusije i edukacije.</p><p>Stranica je rađena u <b>Wordpress</b> tehnologiji uz korištenje raznih <b>plugin-ova</b> kao što su:</p><ul class='unordered-list'><li>Duplicator</li><li>Envira Gallery</li><li>Smooth Back To Top Button</li><li>Tabs Responsive</li><li>wpDataTables - Tables & Table Charts</li><li>Elementor</li></ul><p>Stranica je puna objava s raznih događanja u Mađarskoj i Hrvatskoj, stoga sadrži prijevod na Hrvatski,Mađarski i Engleski jezik za koji se koristio <b>Polylang</b> plugin.</p><p>Stranica je hostana na Netlify-u te ju se može posjetiti <a href='http://gastrotop.hr/' class='link' target='_blank'>preko sljedećeg linka</a>.</p>",

  "single-project-hoteli": "<p>Stranica Hoteli je nastala na fakultetu kao projekt za konstrukcijske vježbe za predmet <b>Osnove Web Programiranja</b>.</p><p>Tema projekta je izabrana zbog rješavanja potencijalne problematike vođenja lanca hotela</p><p>Stranica prikazuje sva naučena znanja o osnovnim web tehnologijama <b>HTML</b>, <b>CSS</b> uz <b>Bootstrap 3.3.7</b> i <b>JavaScript</b> uz <b>jQuery</b>. A za bazu se koristio <b>Firebase</b>.</p><p>Omogućeni su prijava i registracija putem firebase-a uz potpunu provjeru svih unesenih parametara kao što je na primjer provjera pravilnog formata email-a.</p><p><b>Stranica sadrži 3 vrste pregleda:</b></p><ol class='ordered-list'><li>Za običnog gosta stranice koji vidi samo popis hotela.</li><li>Za prijavljenog korisnika koji može rezervirati sobe u hotelima.</li><li>Za prijavljenog admina koji može upravljati samim hotelima. Uređivati, brisati i dodavati ih te uklanjati same rezervacije. Ima uvid u statistiku te može dodavati novog admina.</li></ol>",

  "single-project-moviium": "<p>Izrada stranice Moviium mi je bila dodijeljena kao prvi projekt nakon zaposlenja kako bi stekao znanja u radu sa Anularom i kreiranju API-ja.</p><p>Tema projekta je bila napraviti kopiju prijašnje vlastite aplikacije s fakulteta 'Filmovi' samo u Angularu i s pripadajućim api-jem za obradu podataka i komunikaciju s bazom podataka.</p><p>Za izradu stranice korišten je <b>Angular</b> koji koristi <b>Bootstrap</b> za dizajn. Za izradu api-ja korišten je <b>ASP.NET Core Web API</b> koji koristi <b>Swagger</b> za prikaz kreiranih kontrolera. Za bazu podataka korišten je <b>Microsoft SQL Server</b>.</p><p>Aplikacija sadrži prijavu i registraciju uz potrebne provjere unesenih parametara, a za dohvaćanje filmova i njihovih podataka koristi se <a class='link' target='_blank' href='https://www.omdbapi.com/'>OMDb API</a>.</p><p><b>Nakon uspješne prijave, u aplikaciji je moguće:</b></p><ol class='ordered-list'><li>pretražiti filmove po nazivu</li><li>pogledati detalje pojedinog filma</li><li>dodavanje filmova u svoju listu uz dodjelu vlastite ocjene</li><li>pogledati svoju listu filmova</li><li>ažurirati dodijeljene ocjene</li><li>uklanjanje filmova iz svoje liste</li></ol>",

  "single-project-tasty-trap": "<p>Projekt Tasty Trap je nastao na fakultetu kao projekt za konstrukcijske vježbe iz predmeta <b>CMS sustavi</b>.</p><p>Tema projekta je bila kreirati wordpress temu za fast food koristeći custom post type-ove, taksonomije i custom meta box-ove.</p><p>Stranica prikazuje sva naučena znanja o korištenju <b>Wordpress</b> tehnologijom koja koristi <b>PHP</b> programski jezik i <b>MySQL</b> za bazu podataka.</p><p><b>Administrativno sučelje</b></p><ul class='unordered-list'><li>cpt <b>Meni</b> sadrži cpt <b>Hrana</b> i cpt <b>Piće</b> povezanih preko custom meta box-ova</li><li>cpt <b>Hrana</b> i <b>Piće</b> imaju svoje custom meta box-ove koji su nutritivne vrijednosti te se u prikazu menija one zbrajaju</li><li>tu su još <b>Zaposlenik</b>, <b>Restoran</b> i <b>Vijest</b> cpt-ovi sa svojim custom meta box-ovima</li><li>svaki cpt također ima i svoju jedinstvenu taksonomiju</li><li>korišten je i plugin <b>MetaSlider</b>, za prikaz zaposlenika u obliku slidera</li></ul><p><b>Na stranici je moguće:</b></p><ul class='unordered-list'><li>pregledati menije, njihovu hranu i pića</li><li>pregledati hranu sortiranu po taksonomiji</li><li>pregledati pića sortirana po taksonomiji</li><li>pregledati vijesti</li><li>pregledati istaknute zaposlenike i njihove priče</li><li>pronaći lokacije na karti</li><li>pretražiti stranicu</li></ul>",

  "single-project-zadaci": "<p>Projekt Zadaci je nastao na fakultetu kao projekt za konstrukcijske vježbe iz predmeta<b>Web programiranje na strani poslužitelja</b> i <b>Skriptni programski jezici</b>.</p><p>Tema projekta je bila kreirati program za evidenciju zadataka s autorizacijom korisnika i korištenjem hijerarhija gdje klasa Komentar sadrži objekte klasa Korisnik i Zadatak.</p><p>Stranica prikazuje sva naučena znanja o sljedećim web tehnologijama:<b>AngularJs v1.6.9</b> uz <b>jQuery 3.2.1</b>, <b>PHP 7</b> i korišten je <b>Bootstrap 4.4.1</b> za dizajn. A za bazu se koristio <b>MySQL</b>.</p><p><b>Kada se prijavi u aplikaciju, korisnik može:</b></p><ul class='unordered-list'><li>vidjeti svoj profil i ažurirati njegove podatke</li><li>posjetiti profile drugih ljudi s kojima radi na zadacima</li><li>pregledavati svoje dovršene i nedovršene zadatke koje može također sortirati i pretraživati po nazivu</li><li>korisnik svoje zadatke(koje on izvršava) može komentirati i označiti kao dovršene, te uređivati i brisati svoje komentare na njima</li><li>pregledavati kreirane zadatke koje može također sortirati i pretraživati po nazivu i kreirati nove</li><li>kreirane zadatke uređivati, komentirati i obrisati te uređivati i brisati svoje komentare na njima</li><li>u slučaju da se riješeni zadatak od strane korisnika koji ga je kreirao ne smatra zaista dovršenim on ga može vratiti u izvršavanje</li></ul>",

  "single-project-license-plate-math-game-analysis": "<p>Ovaj projekt uključuje rješavanje igre registracijskih pločica, mentalnog izazova koji je izumila Dorotea tijekom svojih čestih putovanja. Igra se vrti oko pronalaženja brojeva registracijskih pločica koji zadovoljavaju određeni matematički uvjet: ''Upotrebom matematičkih operacija i prvih 3 znamenke registracijskog broja, dobiti zadnju znamenku registracije.'</p><p>Glavni cilj ovog projekta je stvoriti Python skriptu koja provodi sveobuhvatnu analizu registracijskih pločica. Skripta izračunava različite statistike i pojedinosti igre, sprema rezultate u strukturiranu CSV datoteku.</p><p>Projekt nudi sljedeće značajke:</p><ol class='ordered-list'><li><b>Python Skripta:</b> Posvećena Python skripta razvijena je kako bi analizirala registracijske pločice.</li><li><b>Izračunavanje Rješenja:</b> Osnovna funkcionalnost skripte leži u izračunavanju broja različitih matematičkih jednadžbi koje se pridržavaju pravila igre za svaki broj registracijske pločice.</li><li><b>Matematičke Operacije:</b> Skripta uključuje sljedeće matematičke operacije:</li><ul class='unordered-list'><li>Zbrajanje</li><li>Oduzimanje</li><li>Množenje</li><li>Dijeljenje</li><li>Faktorijel</li><li>Exponentiranje</li><li>Korijen</li></ul><li><b>CSV Izlaz:</b> Skripta generira CSV datoteku koja bilježi analizirane podatke, uključujući brojeve registracijskih pločica, potencijalna rješenja (ako postoje) i ukupan broj rješenja.</li><li><b>Format Podataka u CSV-u:</b> Zaglavlje CSV datoteke obuhvaća sljedeća polja:</li><ul class='unordered-list'><li><b>plate_num:</b> Broj registracijske pločice. Kada je označen znakom '-', skripta razdvaja zadnju znamenku od ostalih. Analiza je ograničena na registracijske pločice s 4 znamenke.</li><li><b>solution:</b> Ako rješenje postoji, jednadžba je navedena. U slučajevima s više rješenja, bilo koja valjana jednadžba je uključena. Tekstualno predstavljanje rješenja za matematičke operacije slijedi ovaj obrazac:</li><ul class='unordered-list'><li>Zbrajanje: a + b</li><li>Oduzimanje: a - b</li><li>Množenje: a * b</li><li>Dijeljenje: a / b</li><li>Faktorijel: a!</li><li>Exponentiranje: a pow b (čitati kao a na potenciju b, tj. a^b)</li><li>Korijen: a sqrt b (čitati kao b-ti korijen od a, tj. a√b)</li></ul><li><b>total_num:</b> Ukupan broj mogućih rješenja za dani broj registracijske pločice.</li></ul><li><b>Dodatne Napomene:</b></li><ul class='unordered-list'><li>Skripta uzima u obzir zagrade u izračunima, osiguravajući ispravno predstavljanje u polju rješenja.</li><li>Svaka znamenka može biti pomnožena s -1 ili pretpostaviti negativnu vrijednost. Primjerice, rješenje za broj registracijske pločice 5182 može biti izraženo kao:</li><ul class='unordered-list'><li>(-5) - 1 + 8 = 2 (interpretirano kao 5*(-1) - 1 + 8)</li></ul><li>Skripta je dizajnirana za rukovanje rubnim slučajevima i zaobići izračune koji uključuju iznimno velike brojeve (npr. 9!9! što bi moglo izazvati probleme u sustavu).</li></ul><li><b>Bonus Pitanje:</b> Istraživanje bonus pitanja uključuje prilagodbu koda za generiranje popisa registracijskih pločica zajedno s oznakom koja ukazuje na izvedivost postizanja zadnje znamenke koristeći uvjete igre. Razmotrite optimizacije kako biste poboljšali brzinu izvođenja skripte za maksimalnu učinkovitost.</li></ol><p>Nastavak projekta uključuje stvaranje Splunk nadzorne ploče koristeći podatke iz datoteke registration.csv. Nadzorna ploča pruža uvide putem Splunk pretraživanja o različitim aspektima statistike igre.</p>",

  "single-project-cinereserve-the-movie-seat-scheduler": "<p>CineReserve je web aplikacija dizajnirana za upravljanje kinima, omogućavajući korisnicima rezervaciju sjedala za različite filmove. Ovaj projekt ima za cilj pružiti korisničko sučelje koje je jednostavno za korištenje kako administratorima tako i običnim korisnicima kako bi učinkovito interaktirali s sustavom.</p><p><b>Značajke</b></p><ul class='unordered-list'><li><b>Autentikacija Korisnika:</b> Podržava funkcionalnosti prijave i registracije korisnika.</li><li><b>Upravljanje Kinima:</b> Administratori mogu dodavati, uređivati ​​i brisati informacije o kinima, uključujući raspored sjedala.</li><li><b>Upravljanje Filmovima:</b> Administratori mogu dodavati, uređivati ​​i brisati detalje o filmovima povezanim s svakim kinom.</li><li><b>Rezervacija Sjedala:</b> Korisnici mogu rezervirati sjedala za prikazivanje filmova u kinima.</li></ul><p><b>Korištene Tehnologije</b></p><ul class='unordered-list'><li><b>Frontend:</b> HTML, CSS, JavaScript</li><li><b>Backend:</b> Firebase Realtime Database za pohranu podataka</li><li><b>Autentikacija:</b> Firebase Authentication za autentikaciju korisnika</li></ul><p>Aplikacija slijedi Model-View-Controller (MVC) uzorak, koji razdvaja kodnu bazu na tri glavne komponente:</p><ul class='unordered-list'><li><b>Modeli:</b> Predstavljaju podatke i njihovu logiku. Smješteni u js/models/, definiraju strukturu i ponašanje različitih entiteta podataka, poput kina i korisnika.</li><li><b>Pogledi:</b> Odgovorni su za prikazivanje podataka korisnicima i upravljanje korisničkim unosima. Pronađeni u js/views/, pogledi renderiraju elemente sučelja i interagiraju s korisnicima.</li><li><b>Kontroleri:</b> Djeluju kao posrednici između modela i pogleda. Smješteni u js/controllers/, kontroleri upravljaju korisničkim radnjama, ažuriraju podatke u modelima i ažuriraju poglede prema potrebi.</li></ul><p>Korištenjem MVC-a, kodna baza ostaje organizirana i modularna, olakšavajući razumijevanje, održavanje i skalabilnost. Svaka komponenta ima specifičnu odgovornost, promovirajući ponovnu uporabu koda i olakšavajući dodavanje novih značajki ili izmjena bez utjecaja na druge dijelove aplikacije.</p>"
}
